<a href="https://colab.research.google.com/github/Luiskar1/Proyectobanco/blob/main/Proyectobanco2022.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **1) Descripción del Problema**

Las amenazas financieras están mostrando una tendencia sobre el riesgo crediticio de los bancos comerciales a medida que ha surgido la increíble mejora en la industria financiera. De esta forma, una de las mayores amenazas a las que se enfrentan los bancos comerciales es la predicción del riesgo de los clientes de crédito.

Los estudios recientes se centran principalmente en mejorar el rendimiento del clasificador para la predicción de incumplimiento de tarjetas en lugar de un modelo

# **2) Descripción de los Datos**

##**2.1 Librerías**
Llamar o instalar

In [1]:
!pip install numpy

Requirement already satisfied: numpy in /usr/local/lib/python3.7/dist-packages (1.21.6)

In [2]:
import numpy as np
import pandas as pd

## **2.2 Importar datos**

In [3]:
url = "https://raw.githubusercontent.com/Luiskar1/Proyectobanco/main/UCI_Credit_Card.csv"
df=pd.read_csv(url)

##Encabezado

In [4]:
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
0,1,20000.0,2,2,1,24,2,2,-1,-1,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
1,2,120000.0,2,2,2,26,-1,2,0,0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
2,3,90000.0,2,2,2,34,0,0,0,0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
3,4,50000.0,2,2,1,37,0,0,0,0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0
4,5,50000.0,1,2,1,57,-1,0,-1,0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0

## **2.3 Dimension BD**

In [5]:
print(df.shape)

(30000, 25)

##**2.4 Diccionario**
ID : ID de cada cliente
Monto_Credito : cantidad del crédito otorgado en dólares NT (incluye crédito individual y familiar / suplementario
SEXO : Género (1 = masculino, 2 = femenino)
EDUCACIÓN : (1 = posgrado, 2 = universidad, 3 = bachillerato, 4 = otros, 5 = desconocido, 6 = desconocido)
MATRIMONIO : Estado civil (1 = casado, 2 = soltero, 3 = otros)
EDAD : Edad en años
PAY_0 : Estado de reembolso en septiembre de 2005 (-1 = pago debidamente, 1 = retraso en el pago durante un mes, 2 = retraso en el pago durante dos meses,… 8 = retraso en el pago durante ocho meses, 9 = retraso en el pago durante nueve meses o más)
PAY_2 : Estado de reembolso en agosto de 2005 (escala igual a la anterior)
PAY_3 : Estado de reembolso en julio de 2005 (escala igual a la anterior)
PAY_4 : Estado de reembolso en junio de 2005 (escala igual a la anterior)
PAY_5 : Estado de reembolso en mayo de 2005 (escala igual a la anterior)
PAY_6 : Estado de reembolso en abril de 2005 (escala igual a la anterior)
BILL_AMT1 : Monto del extracto de la factura en septiembre de 2005 (dólar NT)
BILL_AMT2 : Monto del extracto de la factura en agosto de 2005 (dólar NT)
BILL_AMT3 : Monto del extracto de la factura en julio de 2005 (dólar NT)
BILL_AMT4 : Monto del extracto de la factura en junio de 2005 (dólar NT)
BILL_AMT5 : Monto del extracto de la factura en mayo de 2005 (dólar NT)
BILL_AMT6 : Monto del extracto de la factura en abril de 2005 (dólar NT)
PAY_AMT1 : Monto del pago anterior en septiembre de 2005 (dólar NT)
PAY_AMT2 : Monto del pago anterior en agosto de 2005 (dólar NT)
PAY_AMT3 : Monto del pago anterior en julio de 2005 (dólar NT)
PAY_AMT4 : Monto del pago anterior en junio de 2005 (dólar NT)
PAY_AMT5 : Monto del pago anterior en mayo de 2005 (dólar NT)
PAY_AMT6 : Monto del pago anterior en abril de 2005 (dólar NT)
default.payment.next.month : pago predeterminado (1 = sí, 0 = no)

In [6]:
print(df.columns.to_list())

['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_0', 'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2', 'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1', 'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6', 'default.payment.next.month']

## **2.5 Recodificación de las variables**

In [11]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  float64
 2   SEX                         30000 non-null  int64
 3   EDUCATION                   30000 non-null  int64
 4   MARRIAGE                    30000 non-null  int64
 5   AGE                         30000 non-null  int64
 6   PAY_0                       30000 non-null  category
 7   PAY_2                       30000 non-null  category
 8   PAY_3                       30000 non-null  category
 9   PAY_4                       30000 non-null  category
 10  PAY_5                       30000 non-null  category
 11  PAY_6                       30000 non-null  category
 12  BILL_AMT1                   30000 non-null  float64
 13  BILL_AMT2                   30000 non-null  float64
 14  BILL_AMT3                   30000 non-null  float64
 15  BILL_AMT4                   30000 non-null  float64
 16  BILL_AMT5                   30000 non-null  float64
 17  BILL_AMT6                   30000 non-null  float64
 18  PAY_AMT1                    30000 non-null  float64
 19  PAY_AMT2                    30000 non-null  float64
 20  PAY_AMT3                    30000 non-null  float64
 21  PAY_AMT4                    30000 non-null  float64
 22  PAY_AMT5                    30000 non-null  float64
 23  PAY_AMT6                    30000 non-null  float64
 24  default.payment.next.month  30000 non-null  int64
dtypes: category(6), float64(13), int64(5), object(1)
memory usage: 4.5+ MB
None

#Se deben recodificar algunas variables que Python no interpreta de manera correcta

In [8]:
#ID debe ser tipo string
df.ID=df.ID.astype(str)

In [12]:
#En ocasiones se deben validar las variables y se comprueban con el diccionario en caso de ser variables categóricas
df.SEX.value_counts()

2    18112
1    11888
Name: SEX, dtype: int64

In [13]:
# Como se observa la variable SEX es de tipo Entero, lo que no es cierto entonces se coniverte a categórica
df.SEX=df.SEX.astype("category")

In [14]:
# Validar la variable EDUCATION para conocer de qué tipo es
df.EDUCATION.value_counts()

2    14030
1    10585
3     4917
5      280
4      123
6       51
0       14
Name: EDUCATION, dtype: int64

In [ ]:
# EDUCATION también es categórica,

In [9]:
df[["PAY_0","PAY_2","PAY_3","PAY_4","PAY_5","PAY_6"]]=df[["PAY_0","PAY_2","PAY_3","PAY_4","PAY_5","PAY_6"]].astype("category")

In [10]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  float64
 2   SEX                         30000 non-null  int64
 3   EDUCATION                   30000 non-null  int64
 4   MARRIAGE                    30000 non-null  int64
 5   AGE                         30000 non-null  int64
 6   PAY_0                       30000 non-null  category
 7   PAY_2                       30000 non-null  category
 8   PAY_3                       30000 non-null  category
 9   PAY_4                       30000 non-null  category
 10  PAY_5                       30000 non-null  category
 11  PAY_6                       30000 non-null  category
 12  BILL_AMT1                   30000 non-null  float64
 13  BILL_AMT2                   30000 non-null  float64
 14  BILL_AMT3                   30000 non-null  float64
 15  BILL_AMT4                   30000 non-null  float64
 16  BILL_AMT5                   30000 non-null  float64
 17  BILL_AMT6                   30000 non-null  float64
 18  PAY_AMT1                    30000 non-null  float64
 19  PAY_AMT2                    30000 non-null  float64
 20  PAY_AMT3                    30000 non-null  float64
 21  PAY_AMT4                    30000 non-null  float64
 22  PAY_AMT5                    30000 non-null  float64
 23  PAY_AMT6                    30000 non-null  float64
 24  default.payment.next.month  30000 non-null  int64
dtypes: category(6), float64(13), int64(5), object(1)
memory usage: 4.5+ MB
None